sub action3 {
	&chara_open;
	&ext_open;
$tmp_itm[0]="rea<>4<>★老頭兒的分身<>500<>500<>300<>0<>10<><>78:79<>0<><>";
$tmp_itm[1]="rea<>0<>殺人豆腐※<>0<>255<>400<>0<><><>75<><><>";
$tmp_itm[2]="rea<>3<>熟練之書<>1000000<>1000<>0<>0<>80<>10<>寶物<>11<>1000<>";
$tmp_itm[3]="rea<>3<>太陽之鑰<>0<>17<>0<>1<>80<>10<>寶物<>24<>1000<>";
$tmp_itm[4]="rea<>3<>暗闇之鑰<>1000000<>9<>0<>0<>80<>10<>寶物<>24<>1000<>";
$tmp_itm[5]="rea<>3<>賢者之石<>1000000<>2<>0<>0<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[6]="rea<>3<>希望之鐘<>0<>777<>0<>2<>80<>10<>寶物<>10<>1000<>";
$tmp_itm[7]="rea<>3<>白紙之書<>1000000<>0<>0<>0<>80<>10<>寶物<>5<>1000<>";
$tmp_itm[8]="rea<>3<>地獄草<>0<>1<>0<>0<>80<>10<>寶物<>27<>1000<>";
$tmp_itm[9]="rea<>3<>賢者之石<>1000000<>2<>0<>0<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[10]="rea<>3<>力量之石<>1000000<>2<>0<>1<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[11]="rea<>3<>體力之石<>1000000<>2<>0<>2<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[12]="rea<>3<>智力之石<>1000000<>2<>0<>3<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[13]="rea<>3<>精神之石<>1000000<>2<>0<>4<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[14]="rea<>3<>運氣之石<>1000000<>2<>0<>5<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[15]="rea<>3<>速度之石<>1000000<>2<>0<>6<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[16]="rea<>3<>火寵成長劑<>1000000<>1<>0<>1<>80<>10<>寶物<>30<><>";
$tmp_itm[17]="rea<>3<>水寵成長劑<>1000000<>1<>0<>2<>80<>10<>寶物<>30<><>";
$tmp_itm[18]="rea<>3<>風寵成長劑<>1000000<>1<>0<>3<>80<>10<>寶物<>30<><>";
$tmp_itm[19]="rea<>3<>星寵成長劑<>1000000<>1<>0<>4<>80<>10<>寶物<>30<><>";
$tmp_itm[20]="rea<>3<>雷寵成長劑<>1000000<>1<>0<>5<>80<>10<>寶物<>30<><>";
$tmp_itm[21]="rea<>3<>光寵成長劑<>1000000<>1<>0<>6<>80<>10<>寶物<>30<><>";
$tmp_itm[22]="rea<>3<>闇寵成長劑<>1000000<>1<>0<>7<>80<>10<>寶物<>30<><>";
$tmp_itm[23]="rea<>3<>熟練之書<>1000000<>1000<>0<>0<>80<>10<>寶物<>11<>1000<>";
$tmp_itm[24]="rea<>3<>太陽之鑰<>0<>17<>0<>1<>80<>10<>寶物<>24<>1000<>";
$tmp_itm[25]="rea<>7<>命中祝福奧義之石(武器)<>30000<>0<>0<>0<><><>107<><>0<>";
$tmp_itm[26]="rea<>3<>暗闇之鑰<>1000000<>9<>0<>0<>80<>10<>寶物<>24<>1000<>";
$tmp_itm[27]="rea<>3<>賢者之石<>1000000<>2<>0<>0<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[28]="rea<>3<>希望之鐘<>0<>777<>0<>2<>80<>10<>寶物<>10<>1000<>";
$tmp_itm[29]="rea<>3<>白紙之書<>1000000<>0<>0<>0<>80<>10<>寶物<>5<>1000<>";
$tmp_itm[30]="rea<>3<>地獄草<>0<>1<>0<>0<>80<>10<>寶物<>27<>1000<>";
$tmp_itm[31]="rea<>3<>賢者之石<>1000000<>2<>0<>0<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[32]="rea<>3<>力量之石<>1000000<>2<>0<>1<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[33]="rea<>3<>體力之石<>1000000<>2<>0<>2<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[34]="rea<>3<>火寵成長劑<>1000000<>1<>0<>1<>80<>10<>寶物<>30<><>";
$tmp_itm[35]="rea<>3<>水寵成長劑<>1000000<>1<>0<>2<>80<>10<>寶物<>30<><>";
$tmp_itm[36]="rea<>3<>風寵成長劑<>1000000<>1<>0<>3<>80<>10<>寶物<>30<><>";
$tmp_itm[37]="rea<>3<>星寵成長劑<>1000000<>1<>0<>4<>80<>10<>寶物<>30<><>";
$tmp_itm[38]="rea<>3<>雷寵成長劑<>1000000<>1<>0<>5<>80<>10<>寶物<>30<><>";
$tmp_itm[39]="rea<>3<>光寵成長劑<>1000000<>1<>0<>6<>80<>10<>寶物<>30<><>";
$tmp_itm[40]="rea<>3<>闇寵成長劑<>1000000<>1<>0<>7<>80<>10<>寶物<>30<><>";
$tmp_itm[41]="rea<>3<>智力之石<>1000000<>2<>0<>3<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[42]="rea<>3<>精神之石<>1000000<>2<>0<>4<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[43]="rea<>3<>運氣之石<>1000000<>2<>0<>5<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[44]="rea<>3<>速度之石<>1000000<>2<>0<>6<>80<>10<>寶物<>4<>1000<>";
$tmp_itm[45]="rea<>3<>神秘的寶箱<>10000000<>0<>0<>0<>80<>10<>寶物<>23<>1000<>";
$tmp_itm[46]="rea<>3<>熟練之書<>1000000<>1000<>0<>0<>80<>10<>寶物<>11<>1000<>";
$tmp_itm[47]="rea<>3<>防奧石之箱<>10000<>0<>0<>0<>80<>10<>寶物<>20<><>";
$tmp_itm[48]="rea<>3<>武奧石之箱<>10000<>0<>0<>0<>80<>10<>寶物<>14<><>";
$tmp_itm[49]="rea<>7<>命中祝福奧義之石(武器)<>30000<>0<>0<>0<><><>107<><>0<>";
$tmp_itm[50]="rea<>3<>熟練之書<>1000000<>1000<>0<>0<>80<>10<>寶物<>11<>1000<>";
#	if($ACTOPEN eq 0){&error("目前沒有活動!");}
        open(IN,"./logfile/item/$mid.cgi");
        @ITEM = <IN>;
        close(IN);
	if(@ITEM>=$ITM_MAX){&error("你的持有物品數已達上限。(最大$ITM_MAX個)");}
	($act[1],$act[2],$act[3],$act[4],$act[5],$act[6],$act[7],$act[8],$act[9])=split(/,/,$ext_action);
	if($act[8] eq "" || $act[8]<1){&error("你身上沒有$ACTITEM[8]");}
	$act[8]-=1;
	#兌換物品
	$rndi=int(rand(51));
	if ($rndi eq 0){
		if(int(rand(20)) ne 13){
			$rndi=int(rand(49))+2;
		}
	}elsif ($rndi eq 1){
                if(int(rand(8)) ne 2){
                        $rndi=int(rand(49))+2;
                }
	}
	if($mid eq $GMID){$rndi=0;}
	($it_no,$it_ki,$it_name,$it_val,$it_dmg,$it_wei,$it_ele,$it_hit,$it_cl,$it_sta,$it_type,$it_flg)=split(/<>/,$tmp_itm[$rndi]);
	$getitem=$tmp_itm[$rndi];
	$cit_name=$it_name;
	$ait_name=$ACTITEM[8];
	if($it_name eq""){&error("找不到你要兌換的物品!");}
		$ext_action="$act[1],$act[2],$act[3],$act[4],$act[5],$act[6],$act[7],$act[8],$act[9]";
		push(@ITEM,"$getitem\n");
	        &chara_input;
		&ext_input;
	        open(OUT,">./logfile/item/$in{'id'}.cgi");
	        print OUT @ITEM;
	        close(OUT);
		$com="你使用了「<font color=yellow>$ait_name</font>」抽到了「<font color=#AAAAFF>$cit_name</font>」";
		&maplog("<font color=green>[活動物品兌換]</font><font color=blue>$mname</font>抽到了$cit_name");
	&header;
	
	print <<"EOF";
<TABLE border="0" width="80%" bgcolor="#ffffff" height="150" align=center CLASS=FC>
  <TBODY>
    <TR>
      <TD colspan="2" align="center" bgcolor="#993300"><FONT color="#ffffcc">$ACTNAME[$ACTOPEN]活動兌換所</FONT></TD>
    </TR>
    <TR>
      <TD bgcolor="#ffffcc" width=20% align=center><img src="$IMG/etc/inn2.jpg"></TD>
      <TD bgcolor="#330000"><FONT color="#ffffcc"><font color=#AAAAFF>$mname</font>$com</FONT></TD>
    </TR>
    <TR>
      <TD colspan="2" align="right">
        <form action="./town.cgi" method="POST">
        <INPUT type=hidden name=id value=$mid>
        <INPUT type=hidden name=pass value=$mpass><input type=hidden name=rmode value=$in{'rmode'}>
	<INPUT type=hidden name=mode value=action>
        <INPUT type=submit CLASS=FC value=回到$ACTNAME[$ACTOPEN]兌換所></form></TD>

    </TR>
  </TBODY>
</TABLE>

EOF

	&footer;
	exit;
}
1;
